apis/other/hotwire-api/simulator-tool.html

<!DOCTYPE html><html><head><meta charset="utf-8"><meta http-equiv="x-ua-compatible" content="ie=edge"><meta name="description"><meta name="viewport" content="width=device-width, initial-scale=1.0"><title>Simulator Tool - Hotwire API</title><link rel="stylesheet" href="/css/normalize.css"><link rel="stylesheet" href="/css/foundation.min.css"><link rel="stylesheet" href="/css/foundation-icons.css"><link rel="stylesheet" href="/css/code/styles/github-gist.css"><link rel="stylesheet" href="/css/styles.css"><link rel="icon" href="/favicon.ico"><link rel="stylesheet" href="/css/he-animate.css"><script src="/js/jquery-3.2.1.min.js"></script><script src="/js/vendor/modernizr.js" async></script><script src="/js/highlight.pack.js"></script><script src="/js/foundation.min.js"></script><script src="/js/Core.js"></script><script src="/js/he-all.js" async></script><script src="/js/environment.js"></script><script src="/js/suga-slider.js"></script><script src="https://ajax.googleapis.com/ajax/libs/webfont/1.4.7/webfont.js"></script><script>WebFont.load({
    google: {
        families: ["Open Sans:300,300italic,400,400italic,600,600italic,700,700italic,800,800italic"]
            }
});</script><script>$(document).ready(function() {
    $('.api-content pre>code').each(function(i, block) {
        hljs.highlightBlock(block);
    });
    Core.init();
});
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-79394707-1', 'auto');
ga('send', 'pageview');
function googleTranslateElementInit() {
    new google.translate.TranslateElement({pageLanguage: 'en', layout: google.translate.TranslateElement.FloatPosition.TOP_LEFT, gaTrack: true, gaId: 'UA-79394707-1'}, 'google_translate_element');
}</script><script type="text/javascript" src="//translate.google.com/translate_a/element.js?cb=googleTranslateElementInit" async></script></head><body><div id="google_translate_element" style="display: none"></div><header id="site-navigation"><nav class="row full-width" id="nav-top"><div class="inner"><ul><li id="adminnav" style="display:none"><a href="/test-properties/schedules-admin">Admin Schedules View</a></li><li id="hotelnav" style="display:none"><a href="/test-properties/schedules">Schedules</a></li><li id="logoutnav" style="display:none"><a href="/test-properties/" onclick="logout();">Logout</a></li></ul></div></nav><nav class="row full-width" id="nav-main"><div class="inner"><a id="logo" href="/"><img src="/images/DevLogo_40k.png"/></a><div class="hide-for-large" id="menu-toggle"></div><div id="menu-wrap"><div class="hide-for-large"></div><ul><li class="mainlink"><a href="/providers">Connectivity for Providers</a></li><li class="mainlink"><a href="/properties">Connectivity for Properties</a></li><li class="mainlink"><a href="/systems">System Providers</a></li><li class="mainlink"><a href="/developer">Developer APIs</a></li><li class="mainlink"><a href="/blog">Blog</a></li><li class="mainlink"><a href="/contact-us">Contact Us</a></li></ul></div></div></nav></header><div class="row full-width"><div class="off-canvas-nav-bar sticky" id="mobileMenuBar"><nav class="title-bar hide-for-large" data-topbar="" role="navigation"><section class="title-bar-left"><button class="menu-icon" type="button" style="outline: none" data-toggle="mobileMenu"><span></span></button></section><span class="title-bar-title"></span></nav></div></div><div class="row full-width"><div class="show-for-large large-3 columns menu api-menu"><nav role="navigation" class="sidebar-nav"><header>Hotwire API</header><ul class="sidebar-nav-items columns" data-magellan-expedition><li class="pagename"><a class="sidebar-nav-item" href="/apis/other/hotwire-api/api-reference.html">API Reference</a></li><li class="pagename"><a class="sidebar-nav-item" href="/apis/other/hotwire-api/getting-connected.html">Getting Connected</a></li><li class="pagename"><a class="sidebar-nav-item" href="/apis/other/hotwire-api/hotwire-faq.html">FAQ</a></li><li class="pagename" data-magellan-arrival="simulator-tool"><a class="sidebar-nav-item" href="#simulator-tool">Simulator Tool</a></li><li class="depth2" data-magellan-arrival="booking-retrieval-simulator"><a class="sidebar-nav-item" href="#booking-retrieval-simulator">Booking Retrieval Simulator</a></li><li class="depth3" data-magellan-arrival="booking-retrieval-request-xml-examples"><a class="sidebar-nav-item" href="#booking-retrieval-request-xml-examples">Booking Retrieval Request XML Examples</a></li><li class="depth3" data-magellan-arrival="booking-retrieval-response-xml-examples"><a class="sidebar-nav-item" href="#booking-retrieval-response-xml-examples">Booking Retrieval Response XML Examples</a></li></ul></nav></div><div class="off-canvas-wrapper"><div class="off-canvas-wrapper-inner" data-off-canvas-wrapper=""><div class="off-canvas position-left hide-for-large" id="mobileMenu" data-off-canvas="" data-auto-focus="false"></div><div class="off-canvas-content" data-off-canvas-content=""><div class="small-12 medium-10 medium-offset-1 large-8 large-offset-3 xlarge-8 xxlarge-6 columns end api-content"><h1 id="simulator-tool" data-magellan-destination="simulator-tool">Simulator tool</h1>
<h2 id="booking-retrieval-simulator" data-magellan-destination="booking-retrieval-simulator">Booking Retrieval Simulator</h2>
<p>The API endpoint in pre-production exposes a simulator that allows a user to retrieve example booking responses. This enables developers to test basic integration with the booking retrieval API without having to create test customer bookings in the pre-production environment.</p>
<p>To invoke the simulator:</p>
<p>Provide your usual apiKey
Use the authorization credentials &#39;hqcsim@hotwire.com:hotwire’ (aHFjc2ltQGhvdHdpcmUuY29tOmhvdHdpcmU=)
Send the request to the pre-production endpoint <a href="https://api.preprod.hotwire.com/xnetApi/v1.1/XnetHotelService?wsdl">https://api.preprod.hotwire.com/xnetApi/v1.1/XnetHotelService?wsdl</a>
Send hotel id 17515
The contents of the response will vary depending on the value sent in the MinsInPast parameter of the request</p>
<p>If MinsInPast is less than or equal to 60, the response will be empty
If MinsInPast is greater than 60, the response will contain several <Booking> elements with various guest, room, and length of stay combinations. One booking will be cancelled.</p>
<h3 id="booking-retrieval-request-xml-examples" data-magellan-destination="booking-retrieval-request-xml-examples">Booking Retrieval Request XML Examples</h3>
<p><strong>Example 1</strong> shows a request for bookings made or cancelled at a hotel within the past 300 minutes.</p>
<pre><code class="lang-xml">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns2=&quot;http://api.xnet.hotwire/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;ns2:retrieveBooking&gt;
         &lt;BookingRetrievalRQ echoToken=&quot;1111111&quot;&gt;
            &lt;Hotel id=&quot;34323&quot;/&gt;
            &lt;MinsInPast&gt;300&lt;/MinsInPast&gt;
         &lt;/BookingRetrievalRQ&gt;
      &lt;/ns2:retrieveBooking&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre>
<h3 id="booking-retrieval-response-xml-examples" data-magellan-destination="booking-retrieval-response-xml-examples">Booking Retrieval Response XML Examples</h3>
<p>Example 1 shows an empty response – there were no confirmed or cancelled bookings made within the requested number of minutes. The <BookingRetrievalResponse> element contains no child <Booking> elements.</p>
<pre><code class="lang-xml">&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;soap:Body&gt;
      &lt;ns2:retrieveBookingResponse xmlns:ns2=&quot;http://api.xnet.hotwire/&quot;&gt;
         &lt;BookingRetrievalRS version=&quot;1&quot; timeStamp=&quot;2012-10-15T10:57:00.777-07:00&quot; echoToken=&quot;1111111&quot;/&gt;
      &lt;/ns2:retrieveBookingResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</code></pre>
<p><strong>Example 2</strong> shows a response with multiple active and cancelled bookings.</p>
<pre><code class="lang-xml">&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;soap:Body&gt;
      &lt;ns2:retrieveBookingResponse xmlns:ns2=&quot;http://api.xnet.hotwire/&quot;&gt;
         &lt;BookingRetrievalRS version=&quot;1&quot; timeStamp=&quot;2012-10-19T10:49:55.543-07:00&quot;&gt;
            &lt;Booking id=&quot;58652752&quot; type=&quot;Book&quot; createDateTime=&quot;2012-10-19T10:46:51-07:00&quot; source=&quot;HW&quot;&gt;
               &lt;Hotel id=&quot;34323&quot;/&gt;
               &lt;RoomStay roomTypeID=&quot;STANDARD&quot; ratePlanID=&quot;XHW&quot; numberOfRooms=&quot;1&quot;&gt;
                  &lt;StayDate arrivalDate=&quot;2012-10-23&quot; departureDate=&quot;2012-10-24&quot;/&gt;
                  &lt;GuestCount adult=&quot;2&quot; child=&quot;0&quot;/&gt;
                  &lt;PerDayRates currency=&quot;AUD&quot;&gt;
                     &lt;PerDayRate stayDate=&quot;2012-10-23&quot; baseRate=&quot;33.3&quot;/&gt;
                  &lt;/PerDayRates&gt;
                  &lt;TotalAmount amountAfterTaxes=&quot;37.0&quot; amountOfTaxes=&quot;3.7&quot; currency=&quot;AUD&quot;/&gt;
                  &lt;PaymentCard cardHolderName=&quot;Test Booking&quot; cardNumber=&quot;5555555555554444&quot; cardCode=&quot;CA&quot; seriesCode=&quot;925&quot; expireDate=&quot;122017&quot;/&gt;
               &lt;/RoomStay&gt;
               &lt;Guest&gt;
                  &lt;PrimaryGuest givenName=&quot;Firstname &quot; middleName=&quot;m&quot; lastName=&quot;lastname &quot;/&gt;
               &lt;/Guest&gt;
            &lt;/Booking&gt;
            &lt;Booking id=&quot; 58652753&quot; type=&quot;Book&quot; createDateTime=&quot;2012-10-19T10:47:42-07:00&quot; source=&quot;HW&quot;&gt;
               &lt;Hotel id=&quot;34323&quot;/&gt;
               &lt;RoomStay roomTypeID=&quot;STANDARD&quot; ratePlanID=&quot;XHW&quot; numberOfRooms=&quot;2&quot;&gt;
                  &lt;StayDate arrivalDate=&quot;2012-10-23&quot; departureDate=&quot;2012-10-25&quot;/&gt;
                  &lt;GuestCount adult=&quot;2&quot; child=&quot;0&quot;/&gt;
                  &lt;PerDayRates currency=&quot;AUD&quot;&gt;
                     &lt;PerDayRate stayDate=&quot;2012-10-23&quot; baseRate=&quot;22.5&quot;/&gt;
                     &lt;PerDayRate stayDate=&quot;2012-10-24&quot; baseRate=&quot;22.5&quot;/&gt;
                  &lt;/PerDayRates&gt;
                  &lt;TotalAmount amountAfterTaxes=&quot;100.0&quot; amountOfTaxes=&quot;10.0&quot; currency=&quot;AUD&quot;/&gt;
                  &lt;PaymentCard cardHolderName=&quot;Test Booking&quot; cardNumber=&quot;5555555555554444&quot; cardCode=&quot;CA&quot; seriesCode=&quot;925&quot; expireDate=&quot;122017&quot;/&gt;
               &lt;/RoomStay&gt;
               &lt;Guest&gt;
                  &lt;PrimaryGuest givenName=&quot;Firstname firstname&quot; lastName=&quot;lastname last name&quot;/&gt;
               &lt;/Guest&gt;
            &lt;/Booking&gt;
            &lt;Booking id=&quot;58652754&quot; type=&quot;Cancel&quot; createDateTime=&quot;2012-10-19T10:49:39-07:00&quot; source=&quot;HW&quot;&gt;
               &lt;Hotel id=&quot;34323&quot;/&gt;
               &lt;RoomStay roomTypeID=&quot;STANDARD&quot; ratePlanID=&quot;XHW&quot; numberOfRooms=&quot;1&quot;&gt;
                  &lt;StayDate arrivalDate=&quot;2012-10-23&quot; departureDate=&quot;2012-10-24&quot;/&gt;
                  &lt;GuestCount adult=&quot;2&quot; child=&quot;0&quot;/&gt;
                  &lt;PerDayRates currency=&quot;AUD&quot;&gt;
                     &lt;PerDayRate stayDate=&quot;2012-10-23&quot; baseRate=&quot;33.3&quot;/&gt;
                  &lt;/PerDayRates&gt;
                  &lt;TotalAmount amountAfterTaxes=&quot;37.0&quot; amountOfTaxes=&quot;3.7&quot; currency=&quot;AUD&quot;/&gt;
                  &lt;PaymentCard cardHolderName=&quot;test booking&quot; cardNumber=&quot;5555555555554444&quot; cardCode=&quot;CA&quot; seriesCode=&quot;925&quot; expireDate=&quot;122017&quot;/&gt;
               &lt;/RoomStay&gt;
               &lt;Guest&gt;
                  &lt;PrimaryGuest givenName=&quot;Firstname firstname&quot; middleName=&quot;m m m&quot; lastName=&quot;lastname last name&quot;/&gt;
               &lt;/Guest&gt;
            &lt;/Booking&gt;
         &lt;/BookingRetrievalRS&gt;
      &lt;/ns2:retrieveBookingResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</code></pre>
</div></div></div></div></div><footer class="row full-width" id="site-footer"><div class="large-8 large-centered columns"><div class="links text-center"><a class="link-item" href="https://www.expediapartnercentral.com" target="_blank">Expedia PartnerCentral</a><a class="link-item" href="https://help.expediapartnercentral.com/en/your-connectivity/connectivity?hotel_id=14831843" target="_blank">Help Center</a><a class="link-item" href="/terms">Terms and Conditions</a><a class="link-item" href="/privacy">Privacy Policy</a><a class="link-item last" href="/license">License Agreement</a></div><div class="show-for-large"><div class="footer-logo">&nbsp;</div></div><div id="footer-copyright">&copy; 2017 Expedia, Inc. All rights reserved. Confidential and proprietary.</div></div></footer></body></html>